# Panda
#### Panda is an extremely powerfull version of exel. this library allows us to do lot of thing with data.

In [3]:
import pandas as pd

#### series
* A series is similar to a numpy array but its have axis labels instead of  location and its also hold any arbitary python object.

## creating a series with list

In [2]:
import numpy as np

In [3]:
my_list = [1, 2, 3, 4, 5]
# create a label
labels = ['a','b','c','d','e']

In [4]:
# default:
pd.Series(data=my_list) # by default index position have numeric value.

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
# using labels
pd.Series(data=my_list,index=labels) # also write: pd.Series(my_list,labels)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [17]:
list1 = ['A','B','C','D','E']

In [20]:
pd.Series(list1) # its the example of panda's object holding power

0    A
1    B
2    C
3    D
4    E
dtype: object

## using arrays

In [10]:
arr = np.arange(1,4)

In [11]:
pd.Series(arr)

0    1
1    2
2    3
dtype: int32

In [12]:
labels = ['x','y','z']

In [13]:
pd.Series(arr,labels)

x    1
y    2
z    3
dtype: int32

## using dictionary

In [14]:
my_dict = {'k1': 1, "k2": 3, 'k3': 6}

In [16]:
pd.Series(my_dict)

k1    1
k2    3
k3    6
dtype: int64

In [21]:
dict1 = {'name1':'hello', 'name2': 'hi'}

In [22]:
pd.Series(dict1)

name1    hello
name2       hi
dtype: object

## series operation
* operation based off of index

In [23]:
series1 = pd.Series(data = [1,2,3,4], index = ['ami','tumi','se','tini'])

In [27]:
series2 = pd.Series(data= [4,3,2,1], index = ['ami','tumi','uni','tini'])

In [28]:
series1 + series2

ami     5.0
se      NaN
tini    5.0
tumi    5.0
uni     NaN
dtype: float64

In [29]:
series1 * series2

ami     4.0
se      NaN
tini    4.0
tumi    6.0
uni     NaN
dtype: float64

In [ ]:
# we can also do other operation. but note that if index position not match up then the output give none value of those not match index

## Panda DataFrame:
* dataframe is the main workhorse of pandas. a dataframe have bunch of series objects, all the series share the same index.

In [1]:
from numpy.random import randn

In [4]:
# creating a dataframe
df = pd.DataFrame(data = randn(5,5), index = 'A B C D E'.split(), columns = 'w x y z m'.split())

In [5]:
df

          w         x         y         z         m
A  0.691866 -0.366758 -0.102188  0.609318  0.161942
B  1.342558 -0.790625  1.349793  0.610453  0.037867
C -1.252164 -0.719191 -0.051967 -0.360896 -0.142261
D -1.459981  0.067136  1.545995  0.386753 -0.742060
E -0.278622  0.959465 -0.957390  0.550733 -0.155722

#### selection and indexing of DataFrame

#### with respect of column

In [6]:
df['w']

A    0.691866
B    1.342558
C   -1.252164
D   -1.459981
E   -0.278622
Name: w, dtype: float64

In [7]:
type(df['w']) # we can see that this return a series

pandas.core.series.Series

In [8]:
df['m']

A    0.161942
B    0.037867
C   -0.142261
D   -0.742060
E   -0.155722
Name: m, dtype: float64

In [9]:
# we can also indexing a list of columns
df[['x','y','z']]

          x         y         z
A -0.366758 -0.102188  0.609318
B -0.790625  1.349793  0.610453
C -0.719191 -0.051967 -0.360896
D  0.067136  1.545995  0.386753
E  0.959465 -0.957390  0.550733

#### with respect of row

In [10]:
df.loc['B']

w    1.342558
x   -0.790625
y    1.349793
z    0.610453
m    0.037867
Name: B, dtype: float64

In [11]:
type(df.loc['B']) # its also return a series

pandas.core.series.Series

#### selecting subset of rows and columns

In [24]:
df.loc['A','m']

0.16194168379572269

In [25]:
df.loc[["A",'B'],['w','m']]

          w         m
A  0.691866  0.161942
B  1.342558  0.037867

#### creating new columns using series operation

In [12]:
df['n'] = df['x'] * df['y']

In [13]:
df

          w         x         y         z         m         n
A  0.691866 -0.366758 -0.102188  0.609318  0.161942  0.037478
B  1.342558 -0.790625  1.349793  0.610453  0.037867 -1.067180
C -1.252164 -0.719191 -0.051967 -0.360896 -0.142261  0.037374
D -1.459981  0.067136  1.545995  0.386753 -0.742060  0.103791
E -0.278622  0.959465 -0.957390  0.550733 -0.155722 -0.918582

#### creating new row using series operetion

In [14]:
df.loc['F'] = df.loc['B'] +  df.loc['C']

In [15]:
df

          w         x         y         z         m         n
A  0.691866 -0.366758 -0.102188  0.609318  0.161942  0.037478
B  1.342558 -0.790625  1.349793  0.610453  0.037867 -1.067180
C -1.252164 -0.719191 -0.051967 -0.360896 -0.142261  0.037374
D -1.459981  0.067136  1.545995  0.386753 -0.742060  0.103791
E -0.278622  0.959465 -0.957390  0.550733 -0.155722 -0.918582
F  0.090394 -1.509816  1.297826  0.249557 -0.104394 -1.029806

#### removing column from dataframe

In [16]:
df.drop('n',axis=1)

          w         x         y         z         m
A  0.691866 -0.366758 -0.102188  0.609318  0.161942
B  1.342558 -0.790625  1.349793  0.610453  0.037867
C -1.252164 -0.719191 -0.051967 -0.360896 -0.142261
D -1.459981  0.067136  1.545995  0.386753 -0.742060
E -0.278622  0.959465 -0.957390  0.550733 -0.155722
F  0.090394 -1.509816  1.297826  0.249557 -0.104394

In [17]:
# now if we check the original dataframe we can see 'n' column not remove from dataframe
print(df)

          w         x         y         z         m         n
A  0.691866 -0.366758 -0.102188  0.609318  0.161942  0.037478
B  1.342558 -0.790625  1.349793  0.610453  0.037867 -1.067180
C -1.252164 -0.719191 -0.051967 -0.360896 -0.142261  0.037374
D -1.459981  0.067136  1.545995  0.386753 -0.742060  0.103791
E -0.278622  0.959465 -0.957390  0.550733 -0.155722 -0.918582
F  0.090394 -1.509816  1.297826  0.249557 -0.104394 -1.029806

In [18]:
# if we want permanently remove any column
df.drop('n', axis = 1, inplace = True)

In [19]:
print(df)

          w         x         y         z         m
A  0.691866 -0.366758 -0.102188  0.609318  0.161942
B  1.342558 -0.790625  1.349793  0.610453  0.037867
C -1.252164 -0.719191 -0.051967 -0.360896 -0.142261
D -1.459981  0.067136  1.545995  0.386753 -0.742060
E -0.278622  0.959465 -0.957390  0.550733 -0.155722
F  0.090394 -1.509816  1.297826  0.249557 -0.104394

#### removing row from dataframe

In [20]:
df.drop('F', axis = 0)

          w         x         y         z         m
A  0.691866 -0.366758 -0.102188  0.609318  0.161942
B  1.342558 -0.790625  1.349793  0.610453  0.037867
C -1.252164 -0.719191 -0.051967 -0.360896 -0.142261
D -1.459981  0.067136  1.545995  0.386753 -0.742060
E -0.278622  0.959465 -0.957390  0.550733 -0.155722

In [21]:
# here also we can see row does't remove from original dataframe
df

          w         x         y         z         m
A  0.691866 -0.366758 -0.102188  0.609318  0.161942
B  1.342558 -0.790625  1.349793  0.610453  0.037867
C -1.252164 -0.719191 -0.051967 -0.360896 -0.142261
D -1.459981  0.067136  1.545995  0.386753 -0.742060
E -0.278622  0.959465 -0.957390  0.550733 -0.155722
F  0.090394 -1.509816  1.297826  0.249557 -0.104394

In [22]:
# for permanent remove of any row
df.drop('F', axis = 0, inplace = True)

In [23]:
df

          w         x         y         z         m
A  0.691866 -0.366758 -0.102188  0.609318  0.161942
B  1.342558 -0.790625  1.349793  0.610453  0.037867
C -1.252164 -0.719191 -0.051967 -0.360896 -0.142261
D -1.459981  0.067136  1.545995  0.386753 -0.742060
E -0.278622  0.959465 -0.957390  0.550733 -0.155722

#### conditional selection

In [26]:
# its same as the numpy selection. return the boolean value
df>0

       w      x      y      z      m
A   True  False  False   True   True
B   True  False   True   True   True
C  False  False  False  False  False
D  False   True   True   True  False
E  False   True  False   True  False

In [27]:
# for getting the true value of the dataframe we can pass the dataframe with the original one
df[df>0] # note that here the false values shown as NaN values

          w         x         y         z         m
A  0.691866       NaN       NaN  0.609318  0.161942
B  1.342558       NaN  1.349793  0.610453  0.037867
C       NaN       NaN       NaN       NaN       NaN
D       NaN  0.067136  1.545995  0.386753       NaN
E       NaN  0.959465       NaN  0.550733       NaN

In [29]:
# we can also seletion over a specified colums
df[df['w']<0]

          w         x         y         z         m
C -1.252164 -0.719191 -0.051967 -0.360896 -0.142261
D -1.459981  0.067136  1.545995  0.386753 -0.742060
E -0.278622  0.959465 -0.957390  0.550733 -0.155722

In [30]:
# we get another column or columns with the basis of a column conditional selection
df[df['w']>0]['m']

A    0.161942
B    0.037867
Name: m, dtype: float64

In [32]:
df[df['w']>0][['z','m']]

          z         m
A  0.609318  0.161942
B  0.610453  0.037867

#### using logical operator(&,|)

In [37]:
df[(df['w']>0) & (df['m']<1)]

          w         x         y         z         m
A  0.691866 -0.366758 -0.102188  0.609318  0.161942
B  1.342558 -0.790625  1.349793  0.610453  0.037867

In [38]:
df[(df['w']>0) | (df['m']<1)]

          w         x         y         z         m
A  0.691866 -0.366758 -0.102188  0.609318  0.161942
B  1.342558 -0.790625  1.349793  0.610453  0.037867
C -1.252164 -0.719191 -0.051967 -0.360896 -0.142261
D -1.459981  0.067136  1.545995  0.386753 -0.742060
E -0.278622  0.959465 -0.957390  0.550733 -0.155722

#### creating columns using list

In [46]:
df['new'] = 'a b c d e'.split()

In [47]:
df

          w         x         y         z         m new
A  0.691866 -0.366758 -0.102188  0.609318  0.161942   a
B  1.342558 -0.790625  1.349793  0.610453  0.037867   b
C -1.252164 -0.719191 -0.051967 -0.360896 -0.142261   c
D -1.459981  0.067136  1.545995  0.386753 -0.742060   d
E -0.278622  0.959465 -0.957390  0.550733 -0.155722   e

#### some index function

In [48]:
df.reset_index() # default index

  index         w         x         y         z         m new
0     A  0.691866 -0.366758 -0.102188  0.609318  0.161942   a
1     B  1.342558 -0.790625  1.349793  0.610453  0.037867   b
2     C -1.252164 -0.719191 -0.051967 -0.360896 -0.142261   c
3     D -1.459981  0.067136  1.545995  0.386753 -0.742060   d
4     E -0.278622  0.959465 -0.957390  0.550733 -0.155722   e

In [49]:
df.set_index('new')

            w         x         y         z         m
new
a    0.691866 -0.366758 -0.102188  0.609318  0.161942
b    1.342558 -0.790625  1.349793  0.610453  0.037867
c   -1.252164 -0.719191 -0.051967 -0.360896 -0.142261
d   -1.459981  0.067136  1.545995  0.386753 -0.742060
e   -0.278622  0.959465 -0.957390  0.550733 -0.155722

In [50]:
# this change is not permanent
df

          w         x         y         z         m new
A  0.691866 -0.366758 -0.102188  0.609318  0.161942   a
B  1.342558 -0.790625  1.349793  0.610453  0.037867   b
C -1.252164 -0.719191 -0.051967 -0.360896 -0.142261   c
D -1.459981  0.067136  1.545995  0.386753 -0.742060   d
E -0.278622  0.959465 -0.957390  0.550733 -0.155722   e

In [ ]:
# for permanent change
# run: df.set_index('new',inplace = True)